Repository: avalentino/hashsum
Catalog: po/*.po
Languages: it

source: unexpected value: {}
it: valore inatteso: {}

source: specified hashing algorithm ({}) is different form the one used in the digest file ({})
it: l'algoritmo di hashing specificato ({}) è differente da quello usato nel digest file ({})

source: unble to decode digest line: "{}"
it: impossibile decodificate la seguente linea del digest file: "{}"

source: no algorithm specified; using MD5
it: nessun algoritmo specificato; MD% verrà usato

source: {} computed checksum did NOT match
it: {} il checksum calcolato non corrisponde

source: {} improperly formatted checksum line
it: {} linea di checksunm non è formattata correttamente

source: {}: no properly formatted checksum lines found
it: {}: non è stata trovata nessuna linea di checksum propriamente formattata

source: binary option set to False in incompatible with tag option set to Ture
it: l'opzione binary impostata a False è incompatible con l'opzione tag impostata a True

source: {}: is a directory
it: {}: è una directory

source: binary mode is not supported for stdin on this platform
it: la modalità binaria non è suportata per lo standadr input su questa piattaforma

source: Compute and check message digest with different hash algorithms. The sums are computed as described in https://docs.python.org/3/library/hashlib.html. When checking, the input should be a former output of this program. The default mode is to print a line with checksum, a character indicating input mode ('*' for binary, space for text), and name for each FILE.
it: Calcola e controlla i digest dei messaggi con diversi algoritmi di hashing I checksum sono calcolati come descritto in https://docs.python.org/3/library/hashlib.html. Quando si effettua la verifica, l'input dovrebbe essere un output precedentemente generato da questo programma. La modalità di default è stampare una linea con il checksum, un carattere indicante la modalità di input ('*' per la modalità binary, una spazio per la modalità testo), ed il path per ogni FILE.

source: specify the hashing algorithm (default: MD5)
it: splecifica l'algoritmo di hashing (default: MD5)

source: create a BSD-style checksum
it: crea un checksum in stile BSD

source: read input data in binary mode
it: legge i dati di input in modalità binaria

source: read input data in text mode (default)
it: legg i dati di input in modalità testo (default)

source: read checksum(s) form FILE and check them
it: legge le checksum da FILE e le verifica

source: list available hashing algorithms
it: elenca gli algoritmi di hash disponibili

source: Options that are useful only when verifying checksums
it: Opzioni che sono utili solamente quando si velificano le checksum

source: don't print OK for each successfully verified file
it: non stampa OK per ogni file verificato con successo

source: don't output anything, status code shows success
it: non stampa nulla. Il codice di uscita indica il uccesso

source: exit non-zero for improperly formatted checksum lines
it: esce con un codice diverso da zero se incontra linee di checsum non formattate impropriamente

source: warn about improperly formatted checksum lines
it: stampa un avvertimento in caso di linee di checksnm formattate impropriamente

source: name of file to process. If not specified, or set to -, data are read form the standard input
it: nome del file da processare. Se non specificato, o impostato a -, i dati vengono letti dallo standard input

source: --tag does not support --text mode
it: --tag non supporta la modalità --text

source: the --tag option is meaningless when verifying checksums
it: l'opzione --tag non ha senso quando si verificano i checksum

source: the --binary and --text options are meaningless when verifying checksums
it: le opzioni --binary --text non hanno senso uando si verificano le checksum

source: the --status option is meaningful only when verifying checksums
it: l'opsione --status ha senso solo quando si versificano le checksum

source: the --warn option is meaningful only when verifying checksums
it: l'opsione --warn ha senso solo quando si versificano le checksum

source: the --quiet option is meaningful only when verifying checksums
it: l'opsione --quiet ha senso solo quando si versificano le checksum

source: the --strict option is meaningful only when verifying checksums
it: l'opsione --strict ha senso solo quando si versificano le checksum

source: "-" cannot be used if other file names have been specified
it: "-" non può essere usata se altri filename sono stati specificati

source: Available hash algoritms:
it: Algoritmi di hash disponibili:
